app/views/projects/show.html.erb

SELECT "workers"."name", "workers"."id" FROM "workers" WHERE NOT (id in (1,2))
---
						<div class="col-8">
							<%= form.select :worker_id, Worker.where.not("id in (?)", @workers.pluck(:id)).pluck(:name, :id), {}, class: 'form-control' %>