app/controllers/workpros_controller.rb

INSERT INTO "workpros" ("worker_id", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["worker_id", 1], ["project_id", 1], ["created_at", "2018-09-03 11:04:58.637619"], ["updated_at", "2018-09-03 11:04:58.637619"]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def create
		@worker_id = params[:workpro][:worker_id]
		@project_id = params[:project_id]
		@workpro = Workpro.new()
		@workpro.worker_id = @worker_id
		@workpro.project_id = @project_id
		@workpro.save
		redirect_to project_path(Project.find(@project_id))

SELECT  "workpros".* FROM "workpros" WHERE (worker_id = '1' and project_id = '1') LIMIT $1  [["LIMIT", 1]]
DELETE FROM "workpros" WHERE "workpros"."id" = $1  [["id", 2]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def destroy
		@worker_id = params[:id]
		@project_id = params[:project_id]
		@workpro = Workpro.find_by(["worker_id = ? and project_id = ?", @worker_id, @project_id])
		@workpro.destroy
		redirect_to project_path(Project.find(@project_id))