app/controllers/workers_controller.rb

SELECT "workers".* FROM "workers"
---
  def index
    @workers = Worker.all

INSERT INTO "workers" ("name", "phone", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "hernan"], ["phone", "123900129"], ["address", "añdfljkñf"], ["created_at", "2018-09-03 11:05:28.871470"], ["updated_at", "2018-09-03 11:05:28.871470"]]
---
  def create
    @worker = Worker.new(worker_params)

    respond_to do |format|
      if @worker.save

SELECT  "workers".* FROM "workers" WHERE "workers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_worker
      @worker = Worker.find(params[:id])